<?php
/**
 +-----------------------------------------------------------------------------
 * @ 信息数字化应用例子
 +-----------------------------------------------------------------------------
 * 算法题目：警察局抓了a,b,c,d 四名偷窃嫌疑犯，其中一个人是小偷，审问中，
 * a说：我不是小偷
 * b说：c是小偷
 * c说：小偷肯定是d
 * d说：c在冤枉人
 * 现在已经知道4个人中3个人是真话，一人是假话，问谁是小偷？
 +-----------------------------------------------------------------------------
 * 问题分析：将a,b,c,d进行编号，分别为1，2，3，4.则问题可以用枚举方式尝试解决
 +-----------------------------------------------------------------------------
 * 算法设计：用变量x存放小偷的编号，则x的取值范围从1到4，就假设他们中的某人是
 * 小偷的所以情况。4个人所说的话可以分别写成如下：
 * a说的：x<>或not(x=1)
 * b说的：x=3
 * c说的：x=4
 * d说的：x<>4或not(x=4)
 * 在x的枚举过程中，当这四个逻辑式的值相加等于3时，即可表示四个人中三个人说真
 * 话，一个人说的是假话
 +-----------------------------------------------------------------------------
 */

/* 数字1,2,3,4对应a,b,c,d */
$x = 1;
for ($x=1; $x <= 4; $x=$x+1) {
	if ( ($x<>1) + ($x==3) + ($x==4) + ($x<>4) == 3 ) {
		/* chr() 转化数字为字母 */
		echo chr(64+$x)." is a thief!";
	}
}