<?php
/**
 +-----------------------------------------------------------------------------
 * @ 百钱百鸡问题
 +-----------------------------------------------------------------------------
 * 问题描述：中国古代数学家张丘建在他的算经中提出了著名的百钱百鸡问题：鸡翁一，
 * 值钱5；鸡母一，值钱三；鸡雏三值钱一；百钱买百鸡，翁，母，雏各几何？
 +-----------------------------------------------------------------------------
 * 算法设计2：在公鸡x，母鸡y，的数量确定后，小鸡的数量z就固定为100-x-y，无须再
 * 进行枚举了，此时约束条件只有一个：5 * x + 3 * y + z/3 =100
 +-----------------------------------------------------------------------------
 * 算法分析：以上算法只需枚举尝试20 x 33 = 660 次。实现时约束条件又限定z能被3
 * 整除时，才会判断 5 * x + 3 * y + z/3 =100.这样省去了z不整除3时的算术计算和
 * 条件，进一步提高了算法的效率。此算法结果有三个解
 +-----------------------------------------------------------------------------
 */

for ($x=1; $x <=20; $x++) { 
	for ($y=1; $y <=33; $y++) { 
		$z = 100 - $x - $y;
		if ($z%3==0 && (5*$x+3*$y+$z/3)==100) {
			echo "<hr>";
			echo "<p>公鸡数量：".$x;
			echo "<p>母鸡数量：".$y;
			echo "<p>小鸡数量：".$z;
		}
	}
}


