<?php
/**
 +-----------------------------------------------------------------------------
 * @ 兔子繁殖问题
 +-----------------------------------------------------------------------------
 * 问题描述：一对兔子从出生后第三个月开始，每月生一对小兔子。小兔子到第三个月
 * 又开始生下一代小兔子。假如兔子只生不死，一月份抱来一对刚出生的小兔子，问1年
 * 中每个月各有多少对兔子。
 +-----------------------------------------------------------------------------
 * 问题分析：寻找问题的规律性，需要通过对现实问题的具体实例进行分析，从而抽象出
 * 其中的规律。最基本的分析方法之一是枚举，也就是将问题的求解过程以及各种不同的
 * 情况一一列举出来，从中发现解决问题的方法。下面就分析兔子繁殖的过程。
 * 一对兔子从出生后第三个月开始每月生一对小兔子，第三个月以后每月除了有上一月的
 * 兔子外，还有新下的小兔子，在下表中用斜体数字表示。则第三个月以后兔子的对数就
 * 是前两个月兔子对数的和。繁殖过程如下：
 *  1月   2月   3月     4月    5月      6月  ... 
 *   1    1    1+1=2   2+1=3   3+2=5    5+3=8  ...
 *		<--------->
 *					 <------------->
 *  <------------->
 * 					 <---------------------->
 +-----------------------------------------------------------------------------
 * 数学建模：Y1=Y2=1，Yn=Yn-1 + Yn-1，n=3,4,5,...到此发现这个数列就是著名的斐
 * 波那契数列。这里介绍一个斐波那契数列的小常识：当n趋于无穷时，斐波那契数列前
 * 后两项的商（Xn-1 / Xn）趋于黄金分割数 0.618
 +-----------------------------------------------------------------------------
 */

$_rabbit_01 = _rabbit_01();
$_rabbit_02 = _rabbit_02();

_rabbit_03();
var_dump($_rabbit_01);

// 算法1
function _rabbit_01() {
	$a = 1;
	$b = 1;
	$arr = array(0,$a,$b);
	for ($i=3; $i <=12; $i++) { 
		$c = $a + $b;
		$a = $b;
		$b = $c;
		$arr[$i] = $c;
	}
	return $arr;
}

function _rabbit_02() {
	$a = 1; $b = 1;
	for ($i=1; $i <= 4; $i++) { 
		$c = $a + $b;
		$a = $b + $c;
		$b = $c + $a;
		echo $a.'--'.$b.'--'.$c;
		echo "<br>";
	}
}

function _rabbit_03() {
	$a = 1; $b = 1;
	for ($i=1; $i <= 5; $i++) { 
		$a = $a + $b;
		$b = $a + $b;
		echo $a . '--' . $b;
		echo "<br>";
	}
}